//#include<stdio.h>
//void main() {
//	int a[3][3] = { {1,2,3},{4,5,6},{7,8,9} };
//	//a[행][열] 0-2행 0-2열 ->9개의 배열 요소
//	int i, j;
//	for (i = 0; i < 3; i++) { // i는 행 의미 0-2
//		for (j = 0; j < 3; j++) // j는 열 의미 0-2
//			printf("%d\t", a[i][j]);
//		//i = 0 j = 0   1 2
//		//i = 1 j = 1   1 2
//		//i = 2 j = 2   1 2
//		printf("\n");
//	}
//
//}

#include<stdio.h>
void main() {
	int b[4][3] = {{100,200,300},{10,0,0},{50,100,150},{30,40,0}};
	int i, j, sum = 0;

	
	for (i = 0; i < 4; i++) { // i는 행 의미 0-2 //i가 0일때 0~2까지 돈다. //i가 1일때 0~2까지 돈다.
		for (j = 0; j < 3; j++) // j는 열 의미 0-2 
		{
			printf("%d\t", b[i][j]);
			sum = sum + b[i][j];
		}
		
		//i = 0 j = 0   1 2
		//i = 1 j = 1   1 2
		//i = 2 j = 2   1 2
		printf("\n");
	}
	printf("합계는 : %d", sum);
}